perf-tests/results_v3_20260421_095020/vertx/vegeta_customer_summary_5k.txt
Requests      [total, rate, throughput]         150000, 5000.03, 4999.99
Duration      [total, attack, wait]             30s, 30s, 188.208µs
Latencies     [min, mean, 50, 90, 95, 99, max]  94.292µs, 268.142ms, 191.684µs, 1.128s, 1.58s, 1.941s, 2.067s
Bytes In      [total, mean]                     175500000, 1170.00
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:150000  
Error Set: