perf-tests/results_v3_20260421_095020/vertx/vegeta_customers_100.txt
Requests      [total, rate, throughput]         3000, 100.03, 100.03
Duration      [total, attack, wait]             29.991s, 29.99s, 1.398ms
Latencies     [min, mean, 50, 90, 95, 99, max]  141.916µs, 66.002ms, 913.134µs, 286.639ms, 584.793ms, 824.211ms, 892.19ms
Bytes In      [total, mean]                     2235000, 745.00
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:3000  
Error Set: